app/controllers/dashboard_controller.rb

  def index
    if params[:search]
      @projects = Project.where("name LIKE ? ", "%#{params[:search]}%")
    else
      @projects = Project.all
    end
    @list_groups = current_user.groups.all
    @users = User.all
    @groups = Group.all
    @tasks = Task.all
---
SELECT "projects".* FROM "projects"
SELECT "groups".* FROM "groups"
SELECT "tasks".* FROM "tasks"