app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "description") VALUES (?, ?)  [["name", "trek"], ["description", "trek group"]]
---
  def create
    @project = Project.find(params[:project_id])
  	group = @project.groups.build(group_params)
    group.user_ids = params[:group][:user_ids]
    group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @project = Project.find(params[:project_id])
  	@group = Group.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "groups" SET "name" = ? WHERE "groups"."id" = ?  [["name", "rgergergqerg"], ["id", 1]]
---
  def update
  	Group.find(params[:id]).update(group_params)

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
  	Group.find(params[:id].to_i).destroy