app/controllers/tasks_controller.rb

	def create
		Task.new(task_params).save
---
INSERT INTO "tasks" ("field") VALUES (?)  [["field", "tarefa 1"]]

	def edit
		@task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]

	def update
		Task.find(params[:id].to_i).update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "tasks" SET "field" = ? WHERE "tasks"."id" = ?  [["field", "tarefa 1...."], ["id", 7]]

	def destroy
    	Task.find(params[:id].to_i).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]

  		task = Task.find(params[:id].to_i)
  		task.status = !task.status
  		task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "tasks" SET "status" = ? WHERE "tasks"."id" = ?  [["status", "t"], ["id", 8]]